Revit 2026 API

# TextNoteOptionsVerticalAlignment Property

---

Vertical alignment of the text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VerticalTextAlignment VerticalAlignment { get; set; }
```
```vb
Public Property VerticalAlignment As VerticalTextAlignment
	Get
	Set
```
```cpp
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
	void set (VerticalTextAlignment value);
}
```
```fsharp
member VerticalAlignment : VerticalTextAlignment with get, set
```

#### Property Value

VerticalTextAlignment

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Default is Top alignment.

#### Reference

TextNoteOptions Class

Autodesk.Revit.DB Namespace